ballerina/.results/latency-graalvm.txt
Running 3m test @ http://localhost:8102/conferences
  5 threads and 100 connections
  Thread calibration: mean lat.: 3.524ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.542ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.571ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.530ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.538ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.51ms    1.40ms  26.38ms   87.72%
    Req/Sec   210.84     62.88   666.00     70.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.29ms
 75.000%    3.87ms
 90.000%    4.59ms
 99.000%   10.55ms
 99.900%   14.61ms
 99.990%   20.14ms
 99.999%   26.21ms
100.000%   26.40ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.258     0.000000            1         1.00
       2.321     0.100000        17044         1.11
       2.649     0.200000        34007         1.25
       2.891     0.300000        51076         1.43
       3.095     0.400000        67999         1.67
       3.293     0.500000        84969         2.00
       3.393     0.550000        93545         2.22
       3.497     0.600000       102104         2.50
       3.605     0.650000       110524         2.86
       3.727     0.700000       119000         3.33
       3.867     0.750000       127468         4.00
       3.947     0.775000       131693         4.44
       4.037     0.800000       135959         5.00
       4.143     0.825000       140313         5.71
       4.259     0.850000       144461         6.67
       4.403     0.875000       148677         8.00
       4.491     0.887500       150870         8.89
       4.587     0.900000       152970        10.00
       4.695     0.912500       155050        11.43
       4.835     0.925000       157187        13.33
       5.011     0.937500       159296        16.00
       5.123     0.943750       160384        17.78
       5.251     0.950000       161423        20.00
       5.423     0.956250       162483        22.86
       5.655     0.962500       163536        26.67
       6.039     0.968750       164590        32.00
       6.335     0.971875       165124        35.56
       6.763     0.975000       165656        40.00
       7.391     0.978125       166186        45.71
       8.171     0.981250       166714        53.33
       9.071     0.984375       167246        64.00
       9.551     0.985938       167511        71.11
      10.007     0.987500       167779        80.00
      10.335     0.989062       168048        91.43
      10.679     0.990625       168309       106.67
      11.095     0.992188       168572       128.00
      11.311     0.992969       168705       142.22
      11.527     0.993750       168838       160.00
      11.783     0.994531       168972       182.86
      12.047     0.995313       169105       213.33
      12.351     0.996094       169240       256.00
      12.535     0.996484       169302       284.44
      12.703     0.996875       169369       320.00
      12.847     0.997266       169436       365.71
      13.127     0.997656       169502       426.67
      13.423     0.998047       169568       512.00
      13.583     0.998242       169602       568.89
      13.839     0.998437       169635       640.00
      14.023     0.998633       169668       731.43
      14.247     0.998828       169700       853.33
      14.671     0.999023       169734      1024.00
      14.967     0.999121       169750      1137.78
      15.271     0.999219       169767      1280.00
      15.535     0.999316       169783      1462.86
      16.079     0.999414       169800      1706.67
      16.767     0.999512       169817      2048.00
      17.039     0.999561       169825      2275.56
      17.631     0.999609       169833      2560.00
      17.855     0.999658       169841      2925.71
      18.143     0.999707       169850      3413.33
      18.543     0.999756       169858      4096.00
      18.751     0.999780       169862      4551.11
      18.799     0.999805       169866      5120.00
      18.991     0.999829       169871      5851.43
      19.199     0.999854       169877      6826.67
      19.455     0.999878       169879      8192.00
      19.663     0.999890       169881      9102.22
      21.087     0.999902       169883     10240.00
      21.695     0.999915       169885     11702.86
      21.951     0.999927       169887     13653.33
      22.287     0.999939       169889     16384.00
      22.335     0.999945       169890     18204.44
      22.911     0.999951       169891     20480.00
      22.927     0.999957       169892     23405.71
      23.983     0.999963       169893     27306.67
      25.007     0.999969       169894     32768.00
      25.359     0.999973       169895     36408.89
      25.359     0.999976       169895     40960.00
      25.791     0.999979       169896     46811.43
      25.791     0.999982       169896     54613.33
      26.207     0.999985       169897     65536.00
      26.207     0.999986       169897     72817.78
      26.207     0.999988       169897     81920.00
      26.271     0.999989       169898     93622.86
      26.271     0.999991       169898    109226.67
      26.271     0.999992       169898    131072.00
      26.271     0.999993       169898    145635.56
      26.271     0.999994       169898    163840.00
      26.399     0.999995       169899    187245.71
      26.399     1.000000       169899          inf
#[Mean    =        3.505, StdDeviation   =        1.405]
#[Max     =       26.384, Total count    =       169899]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  180003 requests in 3.00m, 66.95MB read
Requests/sec:   1000.00
Transfer/sec:    380.86KB