ballerina/.results/latency-jvm.txt
Running 3m test @ http://localhost:8102/conferences
  5 threads and 100 connections
  Thread calibration: mean lat.: 3.135ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.131ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.123ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.131ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.574ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.59ms    1.71ms  28.98ms   78.05%
    Req/Sec   210.28    149.85     1.18k    88.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.16ms
 75.000%    4.22ms
 90.000%    5.83ms
 99.000%    9.46ms
 99.900%   12.77ms
 99.990%   23.10ms
 99.999%   25.95ms
100.000%   28.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.998     0.000000            1         1.00
       1.948     0.100000        16995         1.11
       2.317     0.200000        34079         1.25
       2.599     0.300000        51093         1.43
       2.871     0.400000        68014         1.67
       3.161     0.500000        85003         2.00
       3.321     0.550000        93470         2.22
       3.497     0.600000       101984         2.50
       3.697     0.650000       110502         2.86
       3.927     0.700000       118939         3.33
       4.219     0.750000       127503         4.00
       4.403     0.775000       131754         4.44
       4.607     0.800000       135992         5.00
       4.843     0.825000       140171         5.71
       5.119     0.850000       144438         6.67
       5.439     0.875000       148699         8.00
       5.623     0.887500       150796         8.89
       5.827     0.900000       152947        10.00
       6.055     0.912500       155053        11.43
       6.315     0.925000       157158        13.33
       6.619     0.937500       159300        16.00
       6.799     0.943750       160353        17.78
       6.999     0.950000       161408        20.00
       7.247     0.956250       162468        22.86
       7.511     0.962500       163536        26.67
       7.819     0.968750       164600        32.00
       7.975     0.971875       165137        35.56
       8.151     0.975000       165656        40.00
       8.367     0.978125       166193        45.71
       8.591     0.981250       166730        53.33
       8.855     0.984375       167258        64.00
       8.983     0.985938       167514        71.11
       9.167     0.987500       167782        80.00
       9.343     0.989062       168049        91.43
       9.535     0.990625       168311       106.67
       9.743     0.992188       168579       128.00
       9.879     0.992969       168706       142.22
      10.007     0.993750       168843       160.00
      10.159     0.994531       168972       182.86
      10.343     0.995313       169106       213.33
      10.567     0.996094       169237       256.00
      10.679     0.996484       169304       284.44
      10.831     0.996875       169372       320.00
      10.999     0.997266       169437       365.71
      11.207     0.997656       169504       426.67
      11.455     0.998047       169569       512.00
      11.559     0.998242       169604       568.89
      11.695     0.998437       169636       640.00
      11.983     0.998633       169668       731.43
      12.343     0.998828       169701       853.33
      12.863     0.999023       169735      1024.00
      13.127     0.999121       169751      1137.78
      13.375     0.999219       169768      1280.00
      14.159     0.999316       169784      1462.86
      15.007     0.999414       169801      1706.67
      16.103     0.999512       169818      2048.00
      16.399     0.999561       169827      2275.56
      17.103     0.999609       169834      2560.00
      17.919     0.999658       169842      2925.71
      18.447     0.999707       169851      3413.33
      19.599     0.999756       169859      4096.00
      19.999     0.999780       169863      4551.11
      20.479     0.999805       169868      5120.00
      21.519     0.999829       169871      5851.43
      22.207     0.999854       169876      6826.67
      22.863     0.999878       169880      8192.00
      23.007     0.999890       169882      9102.22
      23.103     0.999902       169884     10240.00
      23.679     0.999915       169886     11702.86
      23.839     0.999927       169888     13653.33
      24.143     0.999939       169890     16384.00
      24.223     0.999945       169891     18204.44
      24.383     0.999951       169892     20480.00
      24.911     0.999957       169893     23405.71
      24.927     0.999963       169894     27306.67
      25.151     0.999969       169895     32768.00
      25.231     0.999973       169896     36408.89
      25.231     0.999976       169896     40960.00
      25.711     0.999979       169897     46811.43
      25.711     0.999982       169897     54613.33
      25.951     0.999985       169898     65536.00
      25.951     0.999986       169898     72817.78
      25.951     0.999988       169898     81920.00
      28.751     0.999989       169899     93622.86
      28.751     0.999991       169899    109226.67
      28.751     0.999992       169899    131072.00
      28.751     0.999993       169899    145635.56
      28.751     0.999994       169899    163840.00
      28.991     0.999995       169900    187245.71
      28.991     1.000000       169900          inf
#[Mean    =        3.588, StdDeviation   =        1.709]
#[Max     =       28.976, Total count    =       169900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  179805 requests in 3.00m, 66.88MB read
Requests/sec:    998.89
Transfer/sec:    380.44KB